var MSG_C001 = "@1：结束时间不能先于开始时间，请重新输入！";
var MSG_C002 = "证件号码不正确，请输入正确的证件号码！";
var MSG_C003 = "@1：字符输入长度超出最大限度！";
var MSG_C004 = "@1：日期输入格式不合法，请按照YYYY-MM-DD格式重新输入！";
var MSG_C0004 = "@1：日期输入格式不合法，请按照YYYY-MM-DD HH:mm格式重新输入！";
var MSG_C005 = "@1：日期输入超出今天或者日期不合法";
var MSG_C006 = "电话号码不正确，请输入正确的电话号码！";
var MSG_C007 = "必须项目未输入，请输入@1！";
var MSG_C008 = "@1不能大于@2！";
var MSG_C009 = "@1：请输入数字！";
var MSG_C010 = "选中的管理卡中存在【管理状态】为【删除】的管理卡，无需删除！";
var MSG_C011 = "选中的管理卡中存在【管理状态】为【有效】的管理卡，无需恢复！";
var MSG_C012 = "请选中操作对象！";
var MSG_C013 = "测量方式和测量值必须同时输入！";
var MSG_C014 = "@1：输入的数字不合法，请按照@2格式重新输入！";
var MSG_C015 = "您输入的@1超过了一般正常范围(@2)请确认!";
var MSG_T016 = "<font color=\"red\"><燥热伤肺型></font><br><font color=\"blue\">烦渴多饮，口干咽燥，多食易饥，小便量多，大便干结。舌质红，舌苔薄黄，脉数。</font>";
var MSG_T017 = "<font color=\"red\"><胃燥津伤型></font><br><font color=\"blue\">消谷善饥，大便秘结，口干欲饮，形体消瘦。舌质红，舌苔薄黄，脉滑有力。</font>";
var MSG_T018 = "<font color=\"red\"><肾阴亏虚型></font><br><font color=\"blue\">尿频量多，浊如脂膏，头晕目眩，耳鸣，视物模糊，口干唇燥，失眠心烦。舌红，无苔，脉细弦数。</font>";
var MSG_T019 = "<font color=\"red\"><阴阳两虚型></font><br><font color=\"blue\">尿频量多，面色黧黑，耳轮枯焦，腰膝酸软，消瘦明显，阳痿或月经不调，畏寒面浮。舌淡，苔白，脉沉细无力。</font>";
var MSG_T020 = "<饮食调养篇>\r\n（一）饮食控制，清淡忌糖，定时定量定餐。主食以大米或荞麦面粉为主，副食可适当多食冬瓜、南瓜、苦瓜、藕叶及绿叶菜等。\r\n（二）推荐茶饮\r\n1、乌梅麦冬生津茶\r\n2、石斛黄芩叶茶\r\n（三）推荐食疗方\r\n1、玉竹花粉杞子蒸蛋\r\n2、枸杞山药粥\r\n3、绿豆黑豆赤小豆饮";
var MSG_T050 = "<饮食调养篇>\r\n（一）饮食控制，清淡忌糖，定时定量定餐。主食以大米或黄豆、玉米面粉为主。副食可多食莲藕、豆腐、胡萝卜、黄瓜等。\r\n（二）推荐茶饮\r\n西洋参石斛茶\r\n（三）推荐食疗方\r\n1.参杞山药粥\r\n2.归芪鸡\r\n3.苦瓜炒肉";
var MSG_T051 = "<饮食调养篇>\r\n（一）饮食控制，清淡忌糖，定时定量定餐。主食以大米或黄豆、玉米面粉为主。副食可适当多食莲藕、豆腐、胡萝卜、黄瓜、芝麻、核桃等。\r\n（二）推荐茶饮\r\n石斛生地山药茶\r\n（三）推荐食疗方\r\n1、生地枸杞山药粥\r\n2、花粉山药枸杞粥\r\n3、苦瓜炒肉\r\n4、首乌煮蛋";
var MSG_T052 = "<饮食调养篇>\r\n（一）饮食控制，清淡忌糖，定时定量定餐。主食以大米或未精加工面粉,全麦豆类等为主。副食可适当多食山药、蘑芋、南瓜、芋艿、芹菜、胡萝卜、油菜、洋葱等。\r\n（二）推荐茶饮\r\n1.菊花茶\r\n2.枸杞桑叶菊花茶\r\n（三）推荐食疗方\r\n苁蓉山药苡仁粥";
var MSG_T021 = "<生活起居篇>\r\n按时作息，睡眠时间充足，居住环境适宜。";
var MSG_T022 = "<养生锻炼篇>\r\n遵循“动中有静、静中有动、动静结合、以静为主”的原则。坚持户外锻炼。";
var MSG_T023 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：胰、肾、屏间、交感、下屏尖、三焦、渴点、饥点等。\r\n（二）体穴按压\r\n可选用肺俞、胰俞、胃俞、肾俞、足三里、三阴交、涌泉穴。";
var MSG_T053 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：胰、肾、屏间、交感、下屏尖、三焦、渴点、饥点等。\r\n（二）体穴按压\r\n可选用胰俞、胃俞、脾俞、足三里、三阴交、内庭。";
var MSG_T054 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：胰、肾、屏间、交感、下屏尖、三焦、内分泌等。\r\n（二）体穴按压\r\n可选用胰俞、肝俞、肾俞、太溪、太冲、足三里、三阴交、涌泉穴。";
var MSG_T055 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：胰、肾、屏间、交感、下屏尖、三焦、内分泌等。\r\n（二）体穴按压\r\n可选用胰俞、胃俞、肾俞、足三里、三阴交、涌泉穴。";
var MSG_T024 = "<情志调摄篇>\r\n顺应四季变化规律，遵循四季养生法则，调摄情志，精神乐观，心境清净。培养兴趣爱好，怡神养性。";
var MSG_T056 = "<足疗篇>\r\n足浴方：当归、赤芍、川芎、桂枝各10克，鸡血藤、稀莶草、伸筋草各15克，红花3克。将诸药水煎取汁足浴。";
var MSG_T057 = "<足疗篇>\r\n足浴方：生地、芦根、丹参、赤芍、川芎、桂枝各10克，鸡血藤、稀莶草、伸筋草各15克。将诸药水煎取汁足浴。";
var MSG_T058 = "<足疗篇>\r\n足浴方：生地、熟地、花椒、当归、赤芍、川芎、桂枝各10克，鸡血藤、稀莶草、伸筋草各15克，红花3克。将诸药水煎取汁足浴。";
var MSG_T059 = "<font color=\"red\"><阴虚燥热证></font><br><font color=\"blue\">烦渴多饮,随饮随喝,咽干舌燥,多食善饥,溲赤便秘,舌红少津苔黄,脉滑数或弦数。<br></font>";
var MSG_T060 = "<font color=\"red\"><气阴两虚证></font><br><font color=\"blue\">乏力、气短、自汗,动则加重,口干舌燥,多饮多尿,五心烦热,大便秘结,腰膝酸软,舌淡或红暗、边有齿痕,舌苔薄白少津或少苔,脉细弱。<br></font>";
var MSG_T061 = "<font color=\"red\"><阴阳两虚证></font><br><font color=\"blue\">乏力自汗,形寒肢冷,腰膝酸软,耳轮焦干,多饮多尿,混浊如膏,或浮肿少尿,或五更泻,阳萎早泄,舌淡苔白,脉沉细无力。<br></font>";
var MSG_T062 = "<饮食调养篇>\r\n（一）食疗药膳方为:\r\n1.玉粉杞子蛋：天花粉、枸杞、玉竹煎水，沥出，打入鸡蛋，蒸。\r\n2.杞蓣粥：山药、枸杞适量，加粳米，煮粥。\r\n3.三豆饮:绿豆、黑豆、赤小,煎汤服用。 \r\n4.乌梅生津茶：乌梅、麦冬，泡水当茶饮。\r\n5.石斛芩叶茶：石斛（干、鲜均可）、黄芩叶，开水沏泡，代茶饮。\r\n（二）主食以荞麦面粉为主。副食以冬瓜、南瓜、苦瓜、藕叶及绿叶菜等食物。\r\n";
var MSG_T063 = "<饮食调养篇>\r\n（一）食疗药膳方为:\r\n1.参杞粥：西洋参、山药、枸杞适量，加粳米煮粥。\r\n2.归芪鸡：黄芪、当归、母鸡剁大块，加水抄煮，去浮沫，纳入黄芪、当归炖至肉熟。\r\n3.苦瓜炒肉:鲜苦瓜、瘦猪肉,武火炒后食用等。 \r\n4.首乌适量加水煎半小时,取汁煮鸡蛋,每日1个。\r\n5.益气生津茶：西洋参、石斛，开水沏泡，代茶饮。\r\n（二）主食以黄豆、玉米面粉为主。副食以洋葱、莲藕、豆腐、胡萝卜、黄瓜等。\r\n";
var MSG_T064 = "<饮食调养篇>\r\n（一）食疗药膳方为:\r\n1.苁蓉山药苡仁粥：肉苁蓉、山药、薏苡仁适量,煮粥食,每日两次。 \r\n2.枸杞明目茶：适用于2型糖尿病肝肾阴虚证，表现为头晕眼花、双目干涩者。用法用量：枸杞子、桑叶、菊花，开水沏泡代茶饮。\r\n";
var MSG_T065 = "<养生锻炼篇>\r\n运动疗法是糖尿病治疗中的一项重要措施, 适度而有规律的运动可以使血糖下降, 增加热能消耗, 使患者对胰岛素的敏感性得到改善, 利于糖尿病病情的控制, 改善患者全身状态, 预防慢性并发症的发生和发展。\r\n针对糖尿病运动调养的方法有很多，预防保健操可以通过全方位的手法达到调理脏腑，养阴清热，益气补肾从而辅助调节血糖的目的。主要操作方法如下所示：\r\n（一）固气转晴\r\n拇指内叩掌心，其余四指握拳，扣住拇指，置于两胁，双脚五指抓地，同时环转眼球，顺时针逆时针各20遍。\r\n（二）横推胰区\r\n双手掌由外向内推腹部胰脏体表投影区，一推一拉交替操作20遍。\r\n（三）揉腹部\r\n以神阙为中心揉腹，顺时针逆时针各20遍\r\n（四）按揉腰背\r\n双手握拳，以食指的掌指关节点揉脾俞、胃俞、三焦俞、肾俞，每穴各半分钟。\r\n（五）推擦腰骶\r\n双掌由脾俞自上而下推至八髎穴10遍。\r\n（六）通调脾肾\r\n揉脾经血海、地机、三阴交，揉肾经太溪穴，双手拇指沿胫骨内侧缘由阴陵泉推至太溪5遍。\r\n（七）拳扣胃经\r\n双手握空拳自上而下叩击小腿外侧胃经循行部位五遍，以酸胀为度。\r\n（八）推擦涌泉\r\n用手掌擦涌泉穴，以透热为度。\r\n";
var MSG_T066 = "<按摩调养篇>\r\n1.按摩背腰部：\r\n手掌匀力推揉脊柱两侧，或用按摩棒、老头乐，敲打后颈到腰骶，重点按揉胰俞（第八胸椎棘突下旁开1.5寸）、胃俞（第十二胸椎棘突下旁开1.5寸）、肾俞（第二腰椎棘突下旁开1.5寸）和局部阿是穴(痛点)，适合于2型糖尿病伴乏力、腰背酸痛者。\r\n2.按摩腹部：\r\n双手掌互擦至掌热，左手掌压右手掌紧贴神阙穴（肚脐），从右上腹部向左上腹部，从左上腹部向左下腹部，用力推揉，适合于2型糖尿病腹满、大便不畅者。\r\n3.按摩肢体：\r\n以手指揉点按足三里（外膝眼向下4横指）、三阴交(内踝上3寸)2分钟，以酸胀为度。手擦涌泉穴（前脚掌心）以透热为度，适合于2型糖尿病头晕、乏力、眠差，或下肢麻痛者。\r\n";
var MSG_T067 = "<情志调摄篇>\r\n常用的中医心理疗法有五种:以情胜情法,劝说开导法,移情易性法,暗示解惑法,顺情从欲法。\r\n（一）以情胜情疗法\r\n正确地运用情志之偏,可以纠正阴阳气血之偏,使机体恢复平衡协调而对病情有力;\r\n（二）劝说开导法\r\n运用言语对病人进行劝说开导,是意疗的基本方法。在一定条件下,言语刺激对心理,生理激动都会产生很大影响,因此,应正确地运用“言语”,对病人采取启发诱导的方法,宣传糖尿病的有关知识,提高其战胜疾病的信心,使之主动配合医生进行躯体和饮食治疗。劝说开导,要针对病人不同的思想实际和人格及个人特征,做到有的放矢,生动活泼,耐心细致。\r\n（三）移情易性法\r\n就是排遣情思,改易心志。分散病人对疾病的注意力,使思想焦点从病所移于他处,或改变其周围环境,免于与不良因素接触,或改变病人的内心虑恋的指向性,使其从某种情感纠葛中解放出来,转移于另外的人或物身上等等,称之为“移情”。\r\n（四）暗示解惑法\r\n采用含蓄、间接的方式,影响病人的心理状态,以诱导病人“无形中”接受医生的治疗性意见或产生某种信念或改变其情绪和行为,甚或影响人体的生理机能,从而达到治疗的目的。暗示疗法一般多用语言,也可采用手势、表情、暗示性药物及其它暗号来进行;\r\n（五）顺情从欲法\r\n顺从病人的意志,情绪,满足病人心身的需要。仅用前几种方法是不够的,只有当其生活的基本欲望得到满足时,疾病才有可能自愈。对于心理上的欲望,应当有分析地对待,若是合理的欲望,客观条件又能允许时,应尽力满足其所求或所恶,如创造条件以改变其所处环境,或对其想法表示同情,理解和支持,保证等。\r\n";
var MSG_T068 = "<艾灸篇>\r\n1.灸足三里：\r\n将艾条一端点燃，对准足三里（外膝眼向下4横指），约距0.5—1寸左右，进行熏灸，每侧10—15分钟。适用于2型糖尿病乏力、抵抗力降低、下肢无力者。\r\n2.灸关元：\r\n将艾条一端点燃，对准关元穴（下腹部肚脐下3寸），约距0.5—1寸左右，进行熏灸，每次10—15分钟。适用于2型糖尿病畏寒肢冷，或男子阳痿，抵抗力降低者。\r\n3.注意事项：\r\n防止烫伤。糖尿病患者不适宜于化脓灸。\r\n";
var MSG_T069 = "<针刺篇>\r\n针刺治疗糖尿病常用选穴方法有以下几种：\r\n主穴为脾俞、膈俞、胰俞、足三里、三阴交。配穴为肺俞、胃俞、肝俞、中脘、关元、神门、然谷、阴陵泉等。针刺方法以缓慢捻转，中度刺激平补平泻法，每日或隔日一次，每次留针15—20分钟，10次为一疗程。疗程间隔3—5日。\r\n";
var MSG_T070 = "<耳穴篇>\r\n耳穴按压治疗糖尿病常选用的穴位有：\r\n主穴为胰、胆、肝、肾、缘中、屏间、交感、下屏尖。配穴为三焦、渴点、饥点。根据主证及辨证分型，每次选穴5—6个。\r\n选定耳穴寻得敏感点后，将王不留行置于相应耳穴处，用胶布固定，用食、拇指捻压至酸沉麻痛，每日自行按压3次。每次贴一侧耳，两耳交替。\r\n";
var MSG_T071 = "<足浴篇>\r\n药物组成：当归，赤芍，川芎，桂枝，红花，鸡血藤，希莶草，伸筋草。\r\n适应症：糖尿病周围神经病变及下肢血管病变\r\n用法用量：上述中草药加水3000ml煎熬，现配现用，水温38—42℃（注意水温不宜太热，以防烫伤），药剂以浸没两足内外踝关节上2寸为准，隔日1次，每次30分钟。10次为一疗程，总计5个疗程。\r\n";
var MSG_G025 = "<font color=\"red\"><风阳上扰型></font><br><font color=\"blue\">眩晕耳鸣，头痛且胀，易怒。失眠多梦，或面红目赤，口苦。舌质红，舌苔黄，脉弦滑。</font>";
var MSG_G026 = "<font color=\"red\"><肝肾阴虚型></font><br><font color=\"blue\">眩晕久发，视力减退，少寐健忘，心烦口干，耳鸣，神倦乏力，腰酸膝软。舌红苔薄，脉弦细。</font>";
var MSG_G027 = "<font color=\"red\"><气血亏虚型></font><br><font color=\"blue\">头晕目眩，面色淡白，神倦乏力，心悸少寐。舌淡红，苔薄白，脉弱。</font>";
var MSG_G028 = "<font color=\"red\"><痰浊上蒙型></font><br><font color=\"blue\">头重如裹，视物旋转，胸闷作恶，呕吐痰涎。舌苔白腻，脉弦滑。</font>";
var MSG_G029 = "<饮食调养篇>\r\n（一）饮食清淡均衡\r\n可适当多食芹菜、荠菜、黄瓜、苦瓜、茭白、茄子、芦笋、莴苣、西红柿、胡萝卜、绿豆芽、海蛰、西瓜、柿子、香蕉、山楂、绿豆、紫菜。\r\n（二）推荐茶饮\r\n1、白菊花茶\r\n2、苦丁桑叶菊花钩藤茶\r\n3、菊花山楂决明子茶\r\n（三）推荐食疗方\r\n1、葛根花生粥\r\n2、菊花粥";
var MSG_G059 = "<饮食调养篇>\r\n（一）饮食清淡均衡\r\n可适当多食鸭肉、枸杞头、黄瓜、莲藕、百合、番茄、荸荠、豆腐、香蕉、梨、苹果、核桃仁、芝麻、银耳、枸杞子、黑大豆、黑枣、海参、淡菜。少食羊肉、狗肉、辣椒、葱、蒜等性温燥热之品。\r\n（二）推荐茶饮\r\n1、枸杞菊花茶\r\n2、黑芝麻茶\r\n（三）推荐食疗方\r\n1、桑椹粥\r\n2、首乌黑豆芝麻大枣粥";
var MSG_G060 = "<饮食调养篇>\r\n（一）饮食清淡均衡\r\n可适当多食油菜、白扁豆、豇豆、土豆、山药、胡萝卜、芋艿、香菇、鲫鱼、鹅肉、黄豆、黑枣、红枣、银耳、芝麻、桑椹、芡实、蘑菇、栗子等，少吃有耗气作用的食物，如槟榔、空心菜等。\r\n（二）推荐茶饮\r\n1、龙眼红枣茶\r\n2、党参红枣茶\r\n（三）推荐食疗方\r\n1、当归炖猪蹄\r\n2、归芪蒸鸡";
var MSG_G061 = "<饮食调养篇>\r\n（一）饮食清淡均衡\r\n可适当多食白萝卜、冬瓜、白薯、大蒜、洋葱、木耳、海带、海蛰、紫菜、玉米、花生、山楂。少吃肥肉、甜及油腻的食物。\r\n（二）推荐茶饮\r\n1、荷叶山楂丹参菊花茶\r\n2、陈皮山楂乌龙茶\r\n（三）推荐食疗方\r\n1、马兰头拌海带\r\n2、绿豆海带粥\r\n3、枸杞菊花茶\r\n4、薏米冬瓜汤";
var MSG_G030 = "<生活起居篇>\r\n按时作息，睡眠时间充足，居住环境适宜。";
var MSG_G031 = "<养生锻炼篇>\r\n遵循“动中有静、静中有动、动静结合、以静为主”的原则。坚持户外锻炼。";
var MSG_G032 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n（二）体穴按压\r\n选用太冲、太溪、三阴交、风池、内关等。";
var MSG_G062 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n（二）体穴按压\r\n可选用肾俞、命门、志室、气海、关元、足三里、三阴交。";
var MSG_G063 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n（二）体穴按压\r\n选用气海、血海、中脘、太阳、合谷、足临泣等。";
var MSG_G064 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n用生王不留行，置于相应耳穴处。\r\n选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n（二）体穴按压\r\n选用中脘、丰隆、足三里、头维、血海、公孙等。";
var MSG_G033 = "<情志调摄篇>\r\n顺应四季变化规律，遵循四季养生法则，调摄情志，怡神养性。精神乐观，避免生气，焦虑，紧张。培养兴趣爱好。";
var MSG_G065 = "<情志调摄篇>\r\n顺应四季变化规律，遵循四季养生法则，调摄情志，怡神养性。保持精神乐观，培养兴趣爱好。";
var MSG_G066 = "<情志调摄篇>\r\n顺应四季变化规律，遵循四季养生法则，调摄情志，保持精神乐观，避免多思，多虑。心境清净，培养兴趣爱好。";
var MSG_G067 = "<情志调摄篇>\r\n顺应四季变化规律，遵循四季养生法则，调摄情志，精神乐观，心境清净。培养兴趣爱好，怡神养性。避免生气，焦虑，紧张。";
var MSG_G068 = "<足疗篇>\r\n1.磁石降压方\r\n磁石、石决明、当归、桑枝、枳壳、乌药、蔓荆子、白蒺藜、白芍、炒杜仲、牛膝各6克，独活18克。将诸药水煎取汁足浴。\r\n2.足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水煎煮，取汁足浴。";
var MSG_G069 = "<足疗篇>\r\n1.杜仲木瓜汤\r\n杜仲、桑寄生、木瓜各30克。水煎取汁足浴。\r\n2.足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水煎煮，取汁足浴。";
var MSG_G070 = "<足疗篇>\r\n1.十全大补汤\r\n党参、白术、茯苓、丹参、川芎、当归、赤芍各30克，甘草10克。水煎取汁足浴。\r\n2.足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水煎煮，取汁足浴。";
var MSG_G071 = "<足疗篇>\r\n1.法夏三皮汤\r\n法半夏、陈皮、大腹皮、茯苓皮各30克。水煎取汁足浴。\r\n2.高血压足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水煎煮取汁足浴。";

var MSG_G072 = "<font color=\"red\"><阴虚阳亢证></font><br><font color=\"blue\">主症：头部胀痛、烦躁易怒、腰膝痠软。<br>次症：面红目赤，胁痛口苦，便秘溲黄，五心烦热，口干口渴，失眠梦遗。<br>舌脉：舌红少苔，脉细数或弦细</font>";
var MSG_G073 = "<font color=\"red\"><气血两虚证></font><br><font color=\"blue\">主症：头晕时作、少气乏力。<br>次证：动则气短，头部空痛，自汗或盗汗、心悸失眠。<br>舌脉：舌质淡，脉沉细无力。</font>";
var MSG_G074 = "<font color=\"red\"><痰瘀互结证></font><br><font color=\"blue\">主症：头重或痛。<br>次症：头重如裹，胸脘痞闷，胸痛心悸，纳呆恶心，身重困倦，手足麻木。<br>舌脉：苔腻脉滑。</font>";
var MSG_G075 = "<font color=\"red\"><肾精不足证></font><br><font color=\"blue\">主症：心烦不寐、耳鸣腰酸。<br>次症：心悸健忘、失眠梦遗、口干口渴等症。<br>舌脉：舌淡暗，脉细大无力。</font>";
var MSG_G076 = "<font color=\"red\"><肾阳亏虚证></font><br><font color=\"blue\">主症：背寒恶风，腰膝酸软。<br>次症：头痛遇冷加重，手足发冷，夜尿频数。<br>舌脉：舌淡，脉沉细。</font>";
var MSG_G077 = "<font color=\"red\"><冲任失调证 ></font><br><font color=\"blue\">主症：妇女月经来潮或更年期前后出现头痛、头晕。<br>次证：心烦、失眠、胁痛。<br>舌脉：舌淡暗，脉弦细。</font>";
var MSG_G090 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n菊花茶：白菊花、绿茶，开水冲泡饮服。\r\n苦丁桑叶茶：苦丁茶、菊花、桑叶、钩藤各适量，开水冲泡饮服。\r\n菊楂决明饮：菊花，生山楂片，草决明子各适量。开水冲泡饮服。\r\n（二）推荐食物\r\n芹菜、绿豆、绿豆芽、莴苣、西红柿、菊花、海蛰、山楂、荠菜、西瓜、茭白、茄子、柿子、胡萝卜、香蕉、黄瓜、苦瓜、紫菜、芦笋。\r\n（三）推荐食疗方：\r\n1、葛根粥：葛根、粳米、花生米，加适量水，用武火烧沸后，转用文火煮1小时，分次食用。\r\n2、菊花粥：菊花摘去蒂，上笼蒸后，取出晒干或阴干，然后磨成细末，备用。粳米淘净放入锅内，加清水适量，用武火烧沸后，转用文火煮至半成熟，再加菊花细末，继续用文火煮至米烂成粥。每日两次，晚餐食用。";
var MSG_G091 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n龙眼红枣茶：龙眼肉，红枣，白糖适量，开水冲泡饮服。\r\n党参红枣茶：党参，红枣，茶叶各适量。开水冲泡饮服。亦可将党参、红枣、茶叶加水煎沸3分钟后饮用。\r\n（二）推荐食物\r\n大枣、银耳、芝麻、桑椹。\r\n（三）推荐食疗方：\r\n1、当归炖猪蹄：将猪蹄洗净切成大块，在开水中煮两分钟，去其腥味，捞出。然后再在锅内加水烧开放入猪蹄，加入当归及调料适量，用旺火烧开，改用文火煮至猪蹄熟烂。\r\n2、归芪蒸鸡：炙黄芪，当归，嫩母鸡1只。将黄芪、当归装入纱布袋，口扎紧。将鸡放入沸水锅内氽透、捞出，用凉水冲洗干净。将药袋装入鸡腹，置于蒸盆内，加入葱、姜、盐、黄酒、陈皮、胡椒粉及适量清水，上笼隔水蒸约1小时，食时弃去药袋，调味即成，佐餐食用。";
var MSG_G092 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n降脂益寿茶：荷叶、山楂、丹参、菊花、绿茶各适量，开水冲泡饮服。\r\n陈山乌龙茶：陈皮、山楂、乌龙茶各适量，开水冲泡饮服。\r\n（二）推荐食物\r\n白萝卜、紫菜、白薯、玉米、花生、洋葱、木耳、山楂、海带、海蛰、大蒜、冬瓜。\r\n（三）推荐食疗方：\r\n1、马兰头伴海带：马兰头洗净，用沸水烫至色泽泛青，取出后沥水，切成丝备用。海带用温水浸泡12小时洗净，用沸水烫10分种，取出切成丝，与马兰头同伴，加盐、味精、糖、麻油拌和均匀，佐餐用。\r\n2、绿豆海带粥：绿豆、海带、大米适量。将海带切碎与其它2味同煮成粥，可当晚餐食用。";
var MSG_G093 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n杞菊茶：枸杞子、白（杭）菊花、绿茶各适量，开水冲泡饮服。\r\n黑芝麻茶：黑芝麻、绿茶各适量，开水冲泡饮服。\r\n（二）推荐食物\r\n银耳、枸杞子、黑枣、核桃仁、海参、淡菜、芝麻。\r\n（三）推荐食疗方：\r\n1、桑椹粥：桑椹、粳米各适量，煮成粥，可早晚2次分服。\r\n2、首乌豆枣香粥：何首乌、加水煎浓汁，去渣后加粳米、黑豆，黑芝麻，大枣3—5枚、冰糖适量，同煮为粥，服用不拘时。";
var MSG_G094 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n杜仲茶：杜仲、绿茶各适量。用开水冲泡，加盖5分钟后饮用。\r\n胡桃蜜茶：胡桃仁、茶、蜂蜜各适量。将胡桃仁捣碎，与茶、蜂蜜共放入茶杯中，开水冲泡代茶饮。\r\n（二）推荐食物\r\n韭菜、芝麻、胡桃仁、龙眼肉、羊肉、狗肉、鹿肉。\r\n（三）推荐食疗方：\r\n1、复元汤：淮山药、核桃仁、瘦羊肉、羊脊骨、粳米、葱白各适量，先羊脊骨半小时，加羊肉煮开，撇去浮沫，再加生姜、花椒、料酒、胡椒、八角、食盐即可。\r\n2、杜仲羊肾汤：杜仲，五味子，羊肾，姜、葱、盐、料酒适量。杜仲、五味子洗净包好，加水煮约1小时后加入羊肾片(已去筋膜) ，加姜等调料再煮30分钟，去药包调味即成。";
var MSG_G095 = "<饮食调养篇>\r\n（一）推荐茶饮\r\n归杞梅花茶：当归、枸杞子、白梅花各适量，开水冲泡代茶饮。";
var MSG_G096 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用太冲、太溪、三阴交、风池、内关。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";
var MSG_G097 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用气海、血海、中脘、太阳、合谷、足临泣等。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";
var MSG_G098 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用中脘、丰隆、足三里、头维、血海、公孙。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";
var MSG_G099 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用肾俞、命门、志室、气海、关元、足三里、三阴交。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";
var MSG_G110 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用关元、百会、足三里、三阴交、神阙、大椎。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";
var MSG_G111 = "<按摩调养篇>\r\n（一）耳穴疗法\r\n1．材料：一般常选用生王不留行。\r\n2．选穴：降压沟、降压点、肝、皮质下、高血压点等。\r\n3．操作方法：将王不留行置于相应耳穴处，用胶布固定，每穴用拇、食指对捏，以中等力量和速度按压30—40次, 达到使耳廓轻度发热、发痛。\r\n疗程：两耳穴交替贴压，3—5天一换，14天1个疗程。\r\n（二）体穴按压\r\n1．原理：对于高血压病患者可辨证施穴，穴位按压可起到以指代针、激发经络、疏通气血的效果。\r\n2．选穴：\r\n可选用关元、中极、归来、三阴交、蠡沟、中都。3．方法：用指尖或指节按压所选的穴位，每次按压5—10分钟，以有酸胀感觉为宜，14天1个疗程。";

var MSG_G112 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．磁石降压方：磁石、石决明、当归、桑枝、枳壳、乌药、蔓荆子、白蒺藜、白芍、炒杜仲、牛膝各6克，独活18克。将诸药水煎取汁，放入浴盆中，待温时足浴，每日1次，每次10—30分钟，每剂药可用2—3次。\r\n2．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";
var MSG_G113 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";
var MSG_G114 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．可法夏三皮汤：法半夏、陈皮、大腹皮、茯苓皮各30克。水煎取汁，待温时足浴，每次15—30分钟，每日2次，每日1剂,连续3—5天。\r\n2．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";
var MSG_G115 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．杜仲木瓜汤：杜仲、桑寄生、木瓜各30克。水煎取汁，放入浴盆中，用毛巾蘸药液热熨腰痛部位，待温时足浴，每日2次，每次10—30分钟，每日1剂，连续3—5天。\r\n2．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";
var MSG_G116 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．杜仲木瓜汤：杜仲、桑寄生、木瓜各30克。水煎取汁，放入浴盆中，用毛巾蘸药液热熨腰痛部位，待温时足浴，每日2次，每次10—30分钟，每日1剂，连续3—5天。\r\n2．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";
var MSG_G117 = "<足疗篇>\r\n（一）基本原理及要求\r\n1．原理：泡脚水选用温热（热水），通过温热刺激使腿及全身毛细血管扩张，周围血液分布增多，循环阻力减少，全身血压也随之下降。可以减轻高血压的症状。\r\n2．材料：足浴盆或桶尽量选用木质的为好，桶高应不小于40cm，泡脚水选用温热（热水），水温为40℃。\r\n3．足浴时间：泡脚可每天2次进行，下午与晚间各1次，每次30—40分钟。\r\n4．方法：双足浸泡，尽量让水没过足踝（有足浴桶者可至膝以下），水温保持在40℃。\r\n（二）中药配方\r\n1．三藤汤：香瓜藤、黄瓜藤、西瓜藤各30克。水煎取汁，候温足浴，每日2次，每次10—15分钟，每日1剂，连续7—10天。\r\n2．足浴通用方——邓铁涛教授“浴足方”\r\n怀牛膝、川芎各15克，天麻、钩藤（后下）、夏枯草、吴茱萸、肉桂各10克。上方加水2000ml煎煮，水沸后10分钟，取汁趁温热浴足30分钟，上、下午各1次，2-3周为1疗程。";

var MSG_G118 = "<情志调摄篇>\r\n人顺应四季变化规律，遵循四季养生法则，调摄情志，精神乐观、心境清净。孙思邈在《千金方•养性》中告诫人们 “莫忧愁、莫大怒、莫悲恐、莫大惧……莫大笑、勿汲汲于所欲,勿悁悁怀忿恨……若能勿犯者，则得长生也。”诗词歌赋、琴棋书画、花鸟虫鱼,均可益人心智、怡神养性，有助于高血压病的调治。";
var MSG_G119 = "<平衡饮食篇>\r\n高血压患者在季节变换中要少吃酸性食品，多吃能补益脾胃的食物，如瘦肉、禽蛋、大枣、水果、干果等；多吃韭菜、菠菜、荠菜和葱等新鲜蔬菜，能有效降低胆固醇，减少胆固醇在血管壁上的沉积，利于血压的调控；多吃甘温食物，如大枣、花生、玉米、豆浆等。";
var MSG_G120 = "<运动调治篇>\r\n高血压患者在季节变换中应当遵循“动中有静、静中有动、动静结合、以静为主”的原则。坚持户外锻炼，以户外散步、慢跑、太极拳、气功锻炼等节律慢、运动量小、竞争不激烈，且不需要过度低头弯腰的项目为宜，并以自己活动后不觉疲倦为度。";
var MSG_G121 = "<顺应季节篇>\r\n在季节变化中，通过顺应四时变化，调整阴阳，使人与自然相和谐，从而达到阴平阳秘，养生保健之功效，使高血压患者在四季更替的过程中泰然自处，血压平稳少波动。春季肝气当令，万物生发，血压易偏高，应多做户外活动，注意戒怒；夏季炎热，暑湿为邪，注意饮食勿过油腻及生冷，勿使大汗伤津；秋季干燥，阴虚之人当注意勿使津伤阴亏；冬季寒冷，肾阳不足之人当注重保护阳气，宜足浴。";

var MSG_C034 = "信息获取处理成功时，会将证件类型、证件号码以外的基本信息重置。\r\n请确认是否继续？";
var MSG_C035 = "是否确认删除选择的对象？";
var MSG_C036 = "是否确认恢复选择的对象？";
var MSG_C037 = "@1：时间输入格式不合法，请按照@2格式重新输入！";
var MSG_C038 = "@1：日期输入格式不合法，请按照@2格式重新输入！";
var MSG_C039 = "您尚未登记@1，请在登记@2后再进行此操作！";
var MSG_C040 = "请选择需要做成计划的对象类型！";
var MSG_C041 ="您选择的对象类型的对象年度的随访计划已经作成过。\r\n请确认是否重新作成计划？"	;
var MSG_C042 ="请确认是否作成随访计划？";
var MSG_G043 ="对象年度的高血压患者的年度评估已经执行过。\r\n请确认是否重新评估？";
var MSG_G044 ="请确认是否进行高血压患者的年度评估？";
var MSG_G045 ="危险分层的级别不能低于现级别：@1，请重新输入！";
var MSG_G046 ="迁至医疗机构不能是当前医疗机构！";
var MSG_G047 ="报卡登录成功，可以进行首访登记。\r\n请确认是否继续？";
var MSG_C048 ="迁至区县仍为本区县时，街道（镇）和迁至医疗机构为必须输入项！";
var MSG_C049 ="迁入后选中的对象会成为本社区的管理对象。\r\n请确认是否继续？";
var MSG_C072 ="至少选择一个抽样录入项目！";
var MSG_C073 ="是否确认启动？";
var MSG_J074 ="是否确认将指定的对象设为主卡?";
var MSG_J075 ="是否确认将指定的对象设为附卡?";
var MSG_C076 = "@1的位数不能超过3位，请设置合适的年龄单位!";
var MSG_J077 ="取药信息中输入的药物有重复，请重新输入！";
var MSG_C078 = "必须项目未设定，请设定@1！";
var MSG_J079 = "输入的报告季度不正确，请重新输入！";
var MSG_J080 = "@1不设定时，将无法作成相关计划并影响相关督导工作，请确认！";
var MSG_J081 = "是否已经完成对本次取药信息的确认并登记更新日期？";
var MSG_C082 = "@1不能重复，请重新输入！";
var MSG_G083 = "药物名称不能既选择又输入！";
var MSG_G084 = "吸烟情况选择【每天吸】或【有时吸】或【戒烟】时，吸烟年龄必须输入！";
var MSG_J085 = "您输入的密接者已经存在，请重新输入！";
var MSG_C086 = "该居民健康档案已经存在，不能重复建档！";
var MSG_G087 = "选择失访或者暂时性失访的时候，随访内容以下信息将不被记录。\r\n";
var MSG_C088 = "导出失败！导出结果大于50000条上限。\r\n请增加查询条件，重新搜索后再导出。";
var MSG_C089 = "@1和@2，两者必须输入一个！ ";
var MSG_C090 = "@1、@2和@3，三者必须输入一个！ ";
var MSG_C096 = "@1未输入，请确认！";
var MSG_C900 = "是否确认保存？";
var MSG_C999 = "您所使用的功能尚在开发，敬请期待！";
var MSG_C901 = "@1必须大于@2，请重新输入！";
var MSG_T090 = "只能对@1年@2季度以后的季度进行统计，请重新输入！";
var MSG_C902 = "新建卡时，建卡时间必须在2个月以内，请重新输入！";
var MSG_C903 = "@1：必须至少选择一个作为查询条件！";
var MSG_T904 = "您输入的@1与上次随访数据相比超过@2，请确认！";

var MSG_C097 = "<h2><b>（1）定义:</b><br>强健壮实的体质状态，表现为体态适中，面色红润，精力充沛状态。<br><br>" +
				"<b>（2）体质特征:</b><br>①形体特征：体形匀称健壮。②常见表现：面色、肤色润泽，头发稠密有光泽，目光有神，鼻色明润，嗅觉通利，口和，唇色红润，不易疲劳，精力充沛，耐受寒热，睡眠良好，胃纳佳，二便正常，舌色淡红，苔薄白，脉和有神。" +
				"③心理特征：性格随和开朗。④发病倾向：平素患病较少。⑤对外界环境适应能力：对自然环境和社会环境适应能力较强。<br><br>" +
				"<b>（3）成因:</b><br>先天禀赋良好，后天调养得当。</h2>";

//气虚质
var MSG_C098 = "<h2><b>气虚体质养生法：</b><br>此种体质者，宜选散步、慢跑、交谊舞等不过于激烈的又能增加心肺功能的有氧锻炼项目。开始以低运动量，逐渐增加运动量。" +
				"饮食调养宜常食粳米、糯米、小米、黑米、山药、莜麦、土豆、大枣、胡萝卜、香茹、禽肉、鱼、牛肉等补养气血的食物。" +
				"药膳如：黄芪乌骨鸡盅（乌骨鸡去毛去内脏，洗净，加入浸泡30分钟的黄芪共入盅内，加水适量，隔水炖4小时即可）" +
				"冰糖五果羹（红枣5枚，龙眼肉15克，枸杞子10克，共煮10分钟，稍凉后，把带皮生梨及去皮香蕉切碎，放入温牛乳中，再加冰糖适量）<br><br>" +
				"<b>冠心病：气虚血瘀</b><br>" +
				"表现：胸痛或胸闷，心悸气短，神倦乏力，面色紫暗，舌淡紫，脉弱而涩。" +
				"应选择益气活血，化瘀通络的食物或药物：如山药、玉米、山楂、黄豆、佛手、玫瑰花、葡萄、米醋、灵芝、薤白、黄芪等。" +
				"勿食性寒生冷的食物；勿食高胆固醇食物；忌烟酒，如肥肉、猪肝、鸭蛋、蛋黄、白酒等。<br><br>" +
				"<b>便秘：气虚</b><br>" +
				"表现：虽有便意，临厕努挣乏力，挣则汗出气短，大便并不干硬，但便后神疲气怯，舌淡嫩，苔薄，脉虚。" +
				"应选择有补中益气、通便的食物或药物，如猪肉、牛奶、无花果、黑芝麻、番薯、蜂蜜、核桃、南瓜、阿胶、山药、松子仁、桑椹等。" +
				"勿食生冷性凉食物或药物，如梨、鞍荠、栗子、豇豆、莲子、芡实等。<br><br>" +
				"<b>慢性胃炎：气虚</b><br>" +
				"表现：胃隐隐作痛，喜暖喜按，按之痛减，食后胃痛可缓解，饥饿则痛发，舌淡苔薄。" +
				"应选择有补益中气、养胃功效的食物或药物，如牛肉、羊肉、狗肉、鸡肉、兔肉、鳝鱼、鲫鱼、糯米、粳米、红枣、莲子、饴糖、菱角、南瓜、花生、番薯、樱桃、香菇、猴头菇、人参、芡实、党参、山药、扁豆、黄芪等。" +
				"勿食生冷食物；勿食辛辣刺激伤胃食物，如萝卜、山楂、金橘、柿子、荸荠、苦瓜、豆蔻、蚕豆、胡椒、茶叶、荠菜、荠白、薄荷、槟榔等。<br><br>" +
				"<b>病毒性心肌炎：心气虚弱</b><br>" +
				"表现：心慌气短，动则汗出或自汗，面色苍白，倦怠乏力，饮食减少，四肢欠温，舌淡苔白。" +
				"应选择有温阳益气功效的食物，如驴肉、猪心、红枣、小麦、银耳、葡萄、蜂王浆、百合、人参、肉桂、灵芝、党参、黄芪、西洋参、莲子心、太子参、茯苓等。" +
				"勿食生冷滋腻、破气耗气食物，如蚌、柿子、萝卜、西瓜、地瓜、香蕉、莴苣、绿豆、莼菜、荸荠、槟榔等。<br><br>" +
				"<b>慢性支气管炎：肺气亏虚</b><br>" +
				"表现：病久咳声低微，咳而伴喘，咯痰清稀色白，食少，气短胸闷，神疲乏力，自汗，畏寒。舌淡嫩，苔白，脉弱。" +
				"应选择有补益肺气的食物或药物，如豆浆、金橘、黄芪、太子参、白术、虫草等。" +
				"勿食伤气和熏烤和辛辣食物，如辣椒、胡椒、白酒、熏肉、烤肉等。</h2>";

var MSG_C099 = "<h2><b>阳虚体质养生法：</b><br>此种体质，平时要注意避风寒，多参加慢跑、球类活动、舞蹈及五禽戏、八段锦等，还可常作日光浴、空气浴。" +
				"饮食调养方面，宜多食羊肉、狗肉、鹿肉、鸡肉、韭菜粥、附子粥等壮阳食物。在夏日三伏天，每伏可食附子粥或羊肉附子汤一次。" +
				"在医生指导下，适当服用补益阳气的药物，如：鹿茸、鹿角霜、淫羊藿、巴戟天、仙茅、冬虫夏草、蛤蚧、补骨脂、胡桃、杜仲等，" +
				"药膳如：五香羊肉（肥羊肉500克，煮熟切片，加盐、生姜、大蒜、五香粉及黄酒适量拌匀），" +
				"韭菜炒虾仁（韭菜250克，油炒后放入100克虾仁，再炒片刻，加少许胡椒粉即可）<br><br>" +
				"<b>高血压：肾阳亏虚</b><br>" +
				"表现：腰膝酸软，头晕耳呜，神疲乏力，形寒肢冷，夜尿频多，阳痿遗尿，舌淡胖，脉沉迟无力。" +
				"应选择有温补肾阳的食物或药物，如蜂蜜、芝麻、草莓、无花果、金橘、地瓜、平菇、黄精、灵芝，何首乌、芡实，巴戟天等。" +
				"勿食肥甘厚味、生冷寒凉的食物，亦不可饮浓茶、咖啡、不可饮酒等。<br><br>" +
				"<b>前列腺增生症：肾阳亏虚</b><br>" +
				"表现：小便艰难，点滴不爽，甚则不通，腰膝酸软，神疲乏力，面色恍白，阳痿早泄，舌红苔白，脉沉细而尺弱。" +
				"应选择有温养肾阳利尿的食物药物，如韭菜、莴苣、芋艿、狗肉、麻雀等。" +
				"勿食肥甘厚味、生冷寒凉的食物，亦不可饮浓茶、咖啡、不可饮酒等。</h2>";

var MSG_C100 = "<h2><b>阴虚体质养生法：</b><br>此种体质者，要注意保持环境的安静与凉爽，宜选择太极拳等较和缓的运动，不宜参加过于激烈的球赛、速跑、劲舞等活动。" +
		  		"饮食调养宜清淡凉润，忌肥腻厚味和辛辣燥烈之品，适当多吃些新鲜蔬菜瓜果、豆腐、牛奶、鸡蛋、芝麻、蜂蜜、鱼类及鸭等。" +
		  		"在秋冬季可选食银耳、燕窝、淡菜、海参等益阴之品。在医生指导下酌情服用养阴清热药物，如玄参、生地、何首乌、黄精、五味子、桑椹、麦冬、天冬、玉竹、枸杞、女贞子、山茱萸、龟板等。" +
		  		"药膳如：猪肝菠菜汤（生地煎水30分钟后，加入切片猪肝及菠菜，汤成后放盐、味精及麻油适量），" +
		  		"鲤鱼石决明萝卜汤（鲤鱼原只，萝卜切大块，石决明打碎用布袋装好，加一片生姜，清水6碗，煲约1.5小时，加盐调味）<br><br>" +
				"<b>高血压：肝肾阴虚</b><br>" +
				"表现：头部隐痛，目眩耳呜，五心烦热，腰腿酸软，舌红少苔，脉细或细数。" +
				"应选择有滋补肝肾功效的食物或药物，如蛤、蚌、干贝、鲍鱼、海蜇、芹菜、荠菜、菠菜、黄花菜、枇杷、桑葚、淡菜、梨、荸荠等。" +
				"勿食辛辣食物及助热药物，如狗肉、鸡肉、鸭蛋、羊髓、胡椒、白酒、人参等。<br><br>" +
				"<b>冠心病：气阴两虚</b><br>" +
				"表现：胸闷不适，时作时止，心悸气短，倦怠懒言，头晕，失眠多梦，舌质红薄苔，脉弱而细数。" +
				"应选择有益气养阴的食物或药物，如驴肉、猪心、红枣、小麦、银耳、葡萄、蜂王浆、百合、牛瘦肉、油菜、芹菜、胡萝卜、平菇、豆腐、葛根、枸杞、太子参、山楂、何首乌等。<br><br>" +
				"<b>慢性胃炎：胃阴亏损</b><br>" +
				"表现：多见于萎缩性胃炎，胃部疼痛，口干，纳食不香，便干。舌红少津，少苔或无苔，脉细数。" +
				"应选择有生津养胃功效、酸性甜性的食物，如鸭肉、番茄、草莓、葡萄、石榴、菠萝、李子、柠檬、牛奶、羊奶、银耳、蜂蜜、乌梅、番木瓜、枸杞、木瓜、桑椹、西洋参等。" +
				"勿食辛辣香燥、爆炒伤阴的食物，如爆米花、生姜、辣椒、花椒、胡椒、大蒜、大葱、萝卜、白酒、肉桂、豆蔻、槟榔、红参、八角等。<br><br>" +
				"<b>病毒性心肌炎：阴虚火旺</b><br>" +
				"表现：心悸而烦，咽痛口干，手足心热，夜寐不安，失眠烦躁、盗汗，舌红少苔。" +
				"应选择有生津养阴、安神宁心功效的食物或药物，如海蜇、小麦、苦瓜、黑木耳、银耳、菊花、莲子心、西洋参、麦冬、牡蛎、百合、茯苓等。" +
				"勿食生冷香燥辛散、伤阴食物，如羊肉、狗肉、炒花生、爆米花、辣椒、胡椒、人参、白酒等。<br><br>" +
				"<b>慢性支气管炎：肺阴亏虚</b><br>" +
				"表现：咳久痰少，咯吐不爽，痰黏或夹血丝，咽干口燥，手足心热，舌红少苔，脉细数。" +
				"应选择有养阴清肺功效的食物或药物，如鲫鱼、蚯蚓、豆腐、蜂蜜、百合、杏仁、银耳、梨、冰糖、鸭、豆浆、花生仁、哈士蟆油等。" +
				"勿食辛辣刺激性和爆炒熏烤食物或药物，如白酒、葱、蒜、辣椒、胡椒等。<br><br>" +
				"<b>前列腺增生症：肾阴不足</b><br>" +
				"表现：腰酸腿软，两耳轰鸣，小便频数或淋漓不尽，五心烦热，口舌干燥，大便干结，舌红小苔，脉象细数。" +
				"应选择有滋养肾阴的食物或药物，如菠菜、芋艿、红豆、蚕豆、黑大豆、莲子、熟荷藕、鸭等。</h2>";

var MSG_C101 = "<h2><b>痰湿体质养生法：</b><br>此种体质者，应坚持散步、爬山、慢跑、骑自行车及练八段锦、五禽戏、健美操等运动，并逐渐加大运动量。" +
				"饮食调养宜清淡，忌肥甘厚味，注意节食，可常食萝卜、荸荠、冬瓜、包菜、海蜇、洋葱、扁豆、薏苡仁等。可常服二陈汤，食山楂粥或茶、荷叶粥等。" +
				"药膳如：萝卜丝饼（白萝卜250克，连皮切丝，加入陈皮丝、生姜丝适量及白扁豆50克煮熟后研成泥，加盐少许，拌成馅做成饼，入锅烙熟）<br><br>" +
				"<b>冠心病：痰阻心脉</b><br>" +
				"表现：胸闷如窒而痛，或痛引肩背，气短喘促，体胖多痰，身体困重。舌苔浊腻或滑，脉滑。" +
				"应选择有化痰浊、散结的食物或药物，如乌鱼、山楂、茭白、黑木耳、玉米须、桔皮、芋头、包菜、海蜇、洋葱、扁豆、薏苡仁、萝卜等。<br><br>" +
				"<b>高血压：痰湿壅盛</b><br>" +
				"表现：眩晕头痛，形体肥胖，头重如裹，胸闷，呕吐痰涎，食少多寐，舌胖，苔腻，脉濡滑。" +
				"应选择有燥湿健脾功效的食物或药物，如乌鱼、山楂、茭白、芹菜、黑木耳、玉米须等。" +
				"勿食肥甘油腻黏糯的食物，如肥猪肉、牛髓、猪肝、鸡肉、白酒等。<br><br>" +
				"<b>慢性支气管炎：痰湿蕴肺</b><br>" +
				"表现：咳声重浊，痰多色白，胸闷脘痞，纳少，苔白腻，脉滑。" +
				"应选择有燥湿健脾化痰功效的食物或药物，如白萝卜、冬瓜、山楂、茭白、芹菜、黑木耳、玉米须、罗汉果、白扁豆、白茯苓、白萝卜等。" +
				"勿食肥甘油腻黏糯及甜的食物，如肥猪肉、牛髓、猪肝、鸡肉、白酒、糯米等。</h2>";

var MSG_C102 = "<h2><b>湿热体质养生法：</b><br>此种体质者，宜选择游泳、跑步、球类等运动量大的项目锻炼身体，让体内多余的确良阳气散发出来。" +
				"饮食宜多食新鲜菜水果，如香蕉、西瓜、番茄、莲藕、柿子及绿豆粥、藕粥类，多饮绿茶或白开水，" +
				"忌酒、咖啡和辛辣燥烈食物，如辣椒、胡椒、生姜、狗肉、羊肉、鸡肉、牛肉、鹿肉等。平时可常饮菊药茶、苦丁茶、金银花茶，睡前宜练静功。" +
				"药膳：双瓜炒肉片（猪肉切片后，入油锅炒白后待用，黄瓜及苦瓜各250克入油锅炒熟后，混入肉片共炒加调味料后出锅）。<br><br>" +
				"<b>前列腺增生症：湿热蕴结</b><br>" +
				"表现：小便点滴不畅，或小便频数，短涩灼热浑浊，小腹胀满，大便干结，口苦口粘，舌苔黄厚腻，脉弦数。" +
				"应选择有清热化湿解毒的食物或药物，如西瓜、绿豆、冬瓜、番茄、芹菜、荠菜、猪肚、绿豆芽、黑木耳、茅根等。" +
				"应忌食性热、油炸、重油炒或熏烤的食物，如羊肉、狗肉、辣椒、胡椒、白酒、葱、肉桂等。<br><br>" +
				"<b>慢性胆囊炎：肝胆湿热</b><br>" +
				"表现：胁肋胀闷疼痛，背部酸沉疼痛，口苦而黏，欲呕，厌油腻，周身困倦，大便不畅或便溏，目黄身黄，尿黄，舌红胖，苔黄腻，脉弦滑数。" +
				"应选择有清热利湿功效的食物或药物，如蚌、山楂、茭白、西瓜、荸荠、玉米须等。" +
				"勿食辛辣助火的食物或药物，如螃蟹、猪肥肉、鸡蛋、鹅肉、胡椒、白酒、人参等。</h2>" ;

var MSG_C103 = "<h2><b>瘀血体质养生法：</b><br>此种体质者，宜多练太极拳、八段锦、易筋经、舞蹈及进行按摩，促使气血运行。" +
				"饮食调养宜常食黑豆、油菜、慈姑、桃仁及山楂粥、花生粥，可适量饮丹参酒、山楂酒、红葡萄酒等以助气血畅通。" +
				"也可在医生指导下，选服地黄、丹参、当归、茺蔚子、草决明、三七、五加皮、红花、地龙等药物。" +
				"药膳如：山楂鸡金粥（炒山楂片15克，与粳米50克同煮至烂，烘干研成细末之鸡内金入粥搅拌片刻即成）、桃仁酒（桃仁微炒后捣成泥状，加酒250克及砂糖10克，临睡前服一小杯）<br><br>" +
				"<b>冠心病：气虚血瘀</b><br>" +
				"表现：胸痛或胸闷，心悸气短，神倦乏力，面色紫暗，舌淡紫，脉弱而涩。" +
				"应选择益气活血，化瘀通络的食物或药物：如山药、玉米、山楂、黄豆、佛手、玫瑰花、葡萄、米醋、灵芝、薤白、黄芪等。" +
				"勿食性寒生冷的食物；勿食高胆固醇食物；忌烟酒，如肥肉、猪肝、鸭蛋、蛋黄、白酒等。<br><br>" +
				"<b>慢性胃炎：瘀阻胃络</b><br>" +
				"表现：多见于溃疡患者，胃脘刺痛、痛有定处而拒按，食后尤甚，或便血色黑，舌质暗红有瘀斑，脉细涩。" +
				"应选择有活血化瘀、和胃止痛功效的食物或药物，如鹅血、藕、韭菜、菠菜、黑木耳、猴头菇、甘蓝、醋、山楂等。" +
				"勿食生冷性寒、辛辣刺激性食物；勿食过于坚硬的食物，如螃蟹、蚌、蛤蜊、荸荠、生黄瓜、萝卜、香蕉、柿子、西瓜、苦瓜、辣椒、胡椒、葱、姜、白酒等。<br><br>" +
				"<b>前列腺增生症：气滞血瘀</b><br>" +
				"表现：胁腹胀满，尿道涩痛，小便点滴而下，甚则阻塞不通，尿线变细，舌质紫暗，脉象弦涩。" +
				"应选择有活血行滞的食物或药物，如桃仁、牛膝、当归、葱、玫瑰花、藕、芋艿、米酒、红葡萄酒等。</h2>";

var MSG_C104 =	"<h2><b>气郁体质养生法：</b><br>此种体质者，宜多参加文体娱乐活动或社会活动，常看喜剧、小品和听轻松欢快的乐曲，不宜看悲剧。" +
				"常参加体育锻炼、跳集体舞或外出旅游，并培养一些有益身心健康的兴趣爱好，以活跃身心，解除郁闷。" +
				"饮食调养宜多食佛手、柑橘、橙子、荞麦、茴香茶、大蒜、火腿、高梁、香橼等。" +
				"药膳如：决明子海带汤（决明子10克，浸泡后加入海带35克，入锅加水两碗，小火煎熬至一碗，去渣饮汤）、菊花茶（菊花5克，佛手5克，山楂15克，入锅加水两碗，小火煎熬至一碗，去渣饮汤）<br><br>" +
				"<b>便秘：气秘</b><br>" +
				"表现：腹胀欲便，排出不畅，嗳气频作，胸胁痞满，腹中胀痛，纳食减少。舌苔薄腻，脉弦。" +
				"应选择有行气导滞功效的食物，如大麦、荞麦、黄豆、甘薯、菠菜、雍菜、土豆、豆腐、苹果、柠檬、苋菜、白菜、韭菜、萝卜、决明子、槟榔等。" +
				"勿食滋腻补涩的食物或药物，如栗子、豇豆、高梁、辣椒、八角、花椒、莲子、芡实、肉苁蓉、豆蔻、人参、肉桂等。<br><br>" +
				"<b>慢性胃炎：肝胃气滞</b><br>" +
				"表现：胃脘胀痛，常连及胁肋，发怒生气后痛甚，嗳气频作，哎恶泛酸。舌苔薄腻，脉弦。" +
				"应选择有行气消胀功效的食物，如杨梅、橘皮、柚子、萝卜、金橘、荸荠、苦瓜、冬瓜、芹菜、青菜、刀豆、月季花、玫瑰花、佛手柑、茉莉花、山楂、豆蔻、砂仁等。" +
				"勿食肥甘油腻、黏糯壅滞的食物，如蚌、猪肥肉、鹅肉、糯米、栗子、蚕豆、黄豆、豌豆、核桃、番薯、莲子、人参、黄芪、红枣、松子仁、芡实、黄精等。<br><br>" +
				"<b>慢性胆囊炎：肝胆气滞</b><br>" +
				"表现：胁肋，乳房，少腹胀痛，连及肩背，善太息，情绪抑郁，口苦。舌苔薄白，脉弦。" +
				"应选择有疏肝理气、解郁的食物或药物，如胡萝卜、佛手、大麦芽、洋葱、玉米、苹果等。" +
				"勿食辛辣刺激性的食物，勿饮烈酒，如鸡肉、黄油、羊肉、鹅肉、螃蟹、虾、猪油、牛油、煎炸食品，胡椒、白酒、人参等。<br><br>" +
				"<b>前列腺增生症：气滞血瘀</b><br>" +
				"表现：胁腹胀满，尿道涩痛，小便点滴而下，甚则阻塞不通，尿线变细，舌质紫暗，脉象弦涩。" +
				"应选择有活血行滞的食物或药物，如桃仁、牛膝、当归、葱、玫瑰花、藕、芋艿、米酒、红葡萄酒等。" +
				"勿食辛辣刺激性的食物，勿饮烈酒，如鸡肉、黄油、羊肉、鹅肉、螃蟹、虾、猪油、牛油、煎炸食品，胡椒、白酒、人参等。</h2>";

var MSG_C105 =	"<h2><b>特禀体质养生法:</b><br>此种体质者，宜避免容易引起发病的各种因素，选择太极拳，慢跑，散步等轻缓的运动。饮食应避免引起不适的食物为佳。避免浓茶、咖啡和辛辣发物，忌酒。</h2>";
var MSG_C106 = "结案审核后所有信息不允许修订，请确认是否进行结案审核?";
//综合管理	
var MSG_Z106 =  "请选择父节点！";	
var MSG_Z107 =  "请选择根节点！";	
var MSG_Z108 =  "请选择要删除的节点！";	
var MSG_Z109 =  "将同时删除子节点,是否要删除?";	
var MSG_Z110 = "请选中1条记录!";
var MSG_Z111 = "请先选择团队!";
var MSG_Z112 = "该用户已经在团队中!";
var MSG_Z113 = "确定重置用户密码?";
var MSG_Z114 = "确定删除该用户?";
var MSG_Z115 = "确定设置为管理员?";
var MSG_Z116 = "确定取消管理员?";
var MSG_Z117 = "确定解锁账号?";
var MSG_Z118 = "该账号未锁定,无需解锁！";
//肿瘤
var MSG_E117 = "确定取消该条已经审核的报卡?";
var MSG_E118 = "合并对象的ICD-10编码的前3位必须一致，请确认！";
var MSG_E119 = "合并对象的解剖部位编码的前3位必须一致，请确认！";
var MSG_E120 = "合并对象的形态学/行为学编码对应的类型不符合合并规则，请确认！";
var MSG_E121 = "未选中@1，请选择需要合并的@2对象！";
var MSG_E129 = "确定将该报告卡设定成原发？";
var MSG_E127 = "确定对该报告卡进行脱离？";
var MSG_E128 = "确定对该报告卡进行恢复？";
var MSG_E126 = "请输入取消原因!";
var MSG_E130 = "户籍地未核实时，该综合卡会设定为死卡，初访信息中的\r\n初访日期、初访医生、初访单位以外项目均不会保存！";
var MSG_E131 = "要合并的综合卡和报告卡不属于同一人，请重新选择！";
var MSG_E132 = "要合并的综合卡不属于这个人，请重新选择！";
var MSG_E133 = "输入的ICD-10或ICD-O-3与原综合卡中的编码:\r\n@1\r\n不吻合，无法进行合并！\r\n请重新填写或者将该报告卡从综合卡中脱离后修改。";
var MSG_E134 = "居住地未核实时，该综合卡会设定为失访卡，初访信息中的\r\n初访日期、初访医生、初访单位以外项目均不会保存！";
var MSG_E137 =  "该综合卡下只有一张报告卡，如脱离会删除综合卡和所有的初访随访记录，是否继续？";
var MSG_E225 =  "多张综合卡合并时，不能选择报卡";
var MSG_E226 =  "管理单位与原管理单位不一致，不允许保存！";
var MSG_E227 = "ICD-10编码的前3位必须和综合卡一致，请确认！";
var MSG_E228 = "解剖部位编码的前3位必须和综合卡一致，请确认！";
var MSG_E229 = "形态学/行为学编码对应的类型不符合合并规则，请确认！";


var MSG_P122="当疾病选择【无】时，不能同时选择其他疾病，请确认！";
//心脑
var MSG_X123 = "请选择最少一张报卡!";
var MSG_X124 = "不能选择了多个人员下的报卡！";
var MSG_X125 = "@1不能为空，若无具体时间，必须输入未勾选不详因素的时间：@2！";
var MSG_X127 = "请选择报告卡上的人员进行合并！";
var MSG_X128 = "不允许只输入部分的@1，请补充完整或清空数据！(若部分时间未知请选择不详)";
var MSG_X129 = "是否确认提交申请？";
var MSG_X132 = "本报卡非本院报，如修改基本信息以外的项目需区疾控审核。是否确认提交修改申请？";
var MSG_C130 = "输入的@1理由过长，请重新输入！";
var MSG_C131 = "是否确认@1?";
var MSG_C134 = "请选择一个需要取消的按钮!";
var MSG_C135 = "相同疾病分型的报卡才能合并!";
var MSG_C136 = "不能少于两张报卡!";
var MSG_X135 = "恢复成功！";
var MSG_X136 = "心血管报卡疾病分型为冠心病时，报告类型只能选择死亡！";
var MSG_X137 = "有死亡日期时，报告类型不能选为发病！";
var MSG_X138 = "死亡日期距离本次发病日期大于等于29天，报告类型应属于死亡，请重新选择！";
var MSG_X139 = "死亡日期距离本次发病日期小于等于28天，报告类型应属于发病死亡，请重新选择！";
var MSG_X140 = "ICD-10选择为@1时，疾病分型不能选为@2，请重新选择！";
var MSG_X141 = "TIA选择是时，ICD-10必须以G45开头，请重新选择或清除ICD-10！";
var MSG_J140 = "现金支付和账户支付之和不能大于费用合计！";
var MSG_J141 = "请选择就医类型！";
var MSG_J142 = "普通病人保肝药物报销额不能超过800元！\n";
var MSG_J143 = "耐多药病人保肝药物报销额不能超过2400元！\n";
var MSG_J144 = "耐多药病人补助报销额不能超过3000元！\n";
var MSG_C145 = "新增后质控数量不能超过抽样列数，请确认！";
var MSG_C147 = "检测到一些项目有改动，如果希望使用改动后的数据，请先保存。否则手动添加完成后将返回原始值！是否确认继续？";
var MSG_J146 = "对页面的修改不能保存时，将导出原始数据！";
var MSG_J148 = "诊断结果为‘排除’时，非结核/非活动性必须输入，请确认！";
var MSG_C149 = "是否确认将质控任务评价结果数据推送至@1？";
var MSG_G150 = "请至少选择‘设定负责团队’、‘设定负责医生’、‘设定随访医生’中的一个！";
var MSG_G151 = "请选择管理人数大于0的进行操作！";
var MSG_X152 = "‘@1’,‘@2’和‘@3’请至少选择一个！";
var MSG_X153 = "请确保修改后的街道和以前的街道不同!";
var MSG_X154 = "‘通过’和‘病例失访’,‘退回区县’,‘退回医院’请至少选择一个！";
var MSG_J155 = "请至少输入‘断药次数’、‘补治次数’、‘漏治次数’中的一个！";
var MSG_J149 = "管理号根据登记日期、户籍类型、诊断结果自动计算，请输入@1！";
var MSG_C156 = "‘@1’不能为空！";
var MSG_Z157 = "请为更节点添加一个子节点在进行操作！";
var MSG_X158 = "确定申请业务地址变更？";
var MSG_X159 = "街道级别以下的修改，只会修改报告卡，不会发送业务地址变更申请，确定保存？";
var MSG_X160 = "是否确定申请业务地址变更？";
var MSG_X161 = "变更的地址不是试点区县，将会直接更新报告卡，是否继续？";
var MSG_C162 = "是否确认添加选择的对象？";
var MSG_C163 = "是否确定设定选择的对象？";
var MSG_C164 = "请选择‘@1’！";
var MSG_C165 = "确认是否打印？"
var MSG_X166 = "请核对:‘@1’，‘@2’！";
var MSG_J167 = "‘@1’，‘@2’必须成对输入！";
var MSG_C168 = "是否确定设定全部？";
var MSG_C174 = "@1必须输入偶数";


// 死亡
var MSG_S169 = "户籍地省为上海市时，户籍区分必须为沪籍，请重新选择或更改户籍地址！";
var MSG_S170 = "户籍地省为非上海市时，户籍区分必须为非沪籍，请重新选择或更改户籍地址！";
var MSG_J171 = "画面内容已被修改，若进行排序，将丢失未保存的信息！";
var MSG_S172 = "新增报告卡保存成功，是否需要打印？";
var MSG_T173 = "随访日期必须大于等于建卡日期（@1）！";
var MSG_G175 = "建卡日期必须大于等于报告日期（@1）！";
var MSG_S176 = "死亡地点为来院已死时@1必填！";
var MSG_G176 = "未服药血压值应在140/90以上（至少有一个成立）！";
var MSG_J177 = "当前对象有未结案病案，是否仍然需要保存？";
var MSG_S178 = "当前登录医疗机构与户籍地街道不符,不能进行核实！";
var MSG_S179 = "填写直接死亡原因后，其对应编码必填！";
var MSG_S180 = "填写其他疾病后，其对应编码必填！";
var MSG_Z181 = "社区登录时，户籍地街道必须与当前登录医疗机构对应！";
var MSG_C182 = "是否确认办结（不需要死亡补发卡）？";
var MSG_X183 = "发病序次为1时，本次发病时间需要与首次发病日期相等！";
var MSG_X184 = "发病序次大于1时，本次发病时间需要大于首次发病日期！";
var MSG_S185 = "@1必须按顺序填写，之间不能有空值，请确认！";
var MSG_J186 = "您输入的管理号不符合规则，请重新输入！";
var MSG_J187 = "您输入的管理号已存在，请重新输入！";
var MSG_X188 = "报告类型为发病时，相同报卡类型、报告类型的卡才能合并！ ";
var MSG_X189 = "发病时间超过28天，不能合并！";
var MSG_X190 = "户籍地街道与当前登录医疗机构不对应，不能合并！";
var MSG_S191 = "直接死因编码和其他代码两两间不能有相同值：@1，请重新输入！";
var MSG_S192 = "非本区沪籍报卡不得进行区疾控审核！";
var MSG_X192 = "申请操作已成功，即将跳转到上一画面。";
var MSG_X193 = "未获取到死亡时间信息，请手动填写！";
var MSG_C194 = "是否确认打印所有的检索结果？";
var MSG_C195 = "是否确认打印选中的报卡？";
var MSG_Z196 = "有病理号时必须填写病理学类型！";
var MSG_Z197 = "有病理号时必须至少勾选一个相关诊的诊断依据（血片、细胞学、病理（继发）、病理（原发）、尸检（有病理））！";
var MSG_Z198 = "勾选了病理相关诊断依据（血片、细胞学、病理（继发）、病理（原发）、尸检（有病理））时必须填写病理学类型和病理号！";
var MSG_X199 = "TIA发作时，只能报发病！";
var MSG_X200 = "诊断依据只勾选临床时，疾病分型只能为卒中（不分型）！";
var MSG_C201 = "抽样例数超出了最大值(@1)，请重新输入或使用抽样比率！";
var MSG_J202 = "已有相同@1，请重新输入！";
var MSG_G203 = "对象年度的高血压患者存在未更新的对象，\r\n请确认是否继续年度评估";
var MSG_Z204 = "应用代码重复，请重新输入！";
var MSG_J204 = "必须关联一条初诊信息才能建立病案！";
var MSG_G205 = "是否要添加人员？";
var MSG_C206 = "身份证与出生日期不匹配！";
var MSG_J207 = "'@1'与项目内容不匹配！";
var MSG_Z208 = "该条应用参数已存在，请重新输入！";
var MSG_Z209 = "该医院已存在，请重新输入！";
var MSG_G210 = "年度评估正在作成中，不能重复启动！";
var MSG_X211 = "超重或肥胖与bmi不匹配！";
var MSG_C212 = "身份证与性别不匹配！";
var MSG_C213 = "抽样例数为0时不能@1！";
var MSG_C214 = "取消评价将会删除评价结果和推送信息，是否确认取消？";
var MSG_C215 = "'@1'至少输入一个！";
var MSG_C216 = "您输入的证件号码已有@1(@3)@2管理卡，不能重复建卡，请确认！";
var MSG_C217 = "您输入的证件号码对应人员已死亡，不能建卡，请确认！";
var MSG_C218 = "调用WebService产生异常，异常原因为：@1";
var MSG_C219 = "市疾控平台服务调用异常，是否需要继续建卡？（有可能会导致重复建卡情况发生。）";
var MSG_S220 = "证件类型为护照以外时，国籍必须为中国！";
var MSG_S221 = "国籍为中国时，民族必须输入！";
// 零概率、小概率事件
var MSG_ZERO1 = "年龄不能大于等于120岁,请确认！";
var MSG_ZERO2 = "出生日期与身份证不符！";
var MSG_ZERO3 = "填报日期早于死亡日期！";
var MSG_ZERO4 = "死亡日期早于出生日期！";
var MSG_ZERO5 = "根本死因统计分类号不能为“0”，请确认！";
var MSG_ZERO6 = "婴儿、弱智非文盲！";
var MSG_ZERO7 = "学生学历文盲或不详！";
var MSG_ZERO8 = "男性患女性疾病！";
var MSG_ZERO9 = "不适用于女性的编码！";
var MSG_ZERO10 = "死亡地点与死亡医院不对应！";

var MSG_SMALL0 = "不适用于男性的编码！";
var MSG_SMALL1 = "＜6岁非文盲 ！";
var MSG_SMALL2 = "＜20岁非未婚！";
var MSG_SMALL3 = "非育龄妇女的孕产妇疾病！";
var MSG_SMALL4 = "不允许死后推断的疾病！";
var MSG_SMALL5 = "伤害无外部原因或意图不明：根本死因编码为Y10-Y34、Y87.2以及S和T类！";
var MSG_SMALL6 = "心血管病缺乏诊断意义！";
var MSG_SMALL7 = "呼衰、肝衰、肾衰！";
var MSG_SMALL8 = "≥28天新生儿病！";
var MSG_SMALL9 = "＜15岁结核等疾病！";
var MSG_SMALL10 = "＜20岁血吸虫病！";
var MSG_SMALL11 = "＜45岁慢性下呼吸道疾病！";
var MSG_SMALL12 = "＜50岁前列腺增生！";
var MSG_SMALL13 = "＜5岁糖尿病或精神障碍！";
var MSG_SMALL14 = "＞40岁先天畸形！";
var MSG_SMALL15 = "死在家中的传染病！";
var MSG_SMALL16 = "主要职业及工种与年龄不符！";
var MSG_SMALL17 = "死因不明：根本死因编码以“R”开头！";


//组合查询
var MSG_ZHCX1="请先构造查询条件！";
var MSG_ZHCX2="请确认条件已构造完成！";
var MSG_ZHCX3="请填写模板名！";
var MSG_ZHCX4="确实要保存模板并查询吗？";
var MSG_ZHCX5="已经有模版叫此名称，是否要覆盖？";
var MSG_ZHCX6="对不起！你尚未保存任何模版！";
var MSG_ZHCX7="你确定以此模板生成你的查询页面吗？";
var MSG_ZHCX8="当前模板字段总长度(@1)超过上限(3000)，请重新筛选！";

var MSG_C220="操作成功！";
var MSG_T077="您输入的年份报表数据已存在，是否要覆盖？";
var MSG_C221="是否确认要作成当前@1，有可能会覆盖已有数据？";
var MSG_C222="请至少选择一条检测数据!";
var MSG_S222="是否确认删除此卡?";
var MSG_S223="是否确认恢复此卡?";
var MSG_S224="是否确认将此卡设为重卡?";

var MSG_E135="是否确认收到通知？";
var MSG_E136="是否确认收到通知，并撤销此人肿瘤管理？";

var MSG_T078="分段结束值不合法，必须大于当前分段开始值！";
var MSG_T079="评估分数总和必须大于评分标准，请重新输入！";
var MSG_T080="是否开始评分？";
var MSG_T081="删除成功！";
var MSG_C223="'@1'不能全为空!";
var MSG_S225="实足年龄必须大于1岁！";
var MSG_S226="年龄单位选择了月，实足年龄范围为1到11月，多于11月请按年计，少于1月请按天计！";
var MSG_S228="年龄单位选择了天，实足年龄至多27天，多于27天请按月计！";
var MSG_T082="是否开始评估？";
var MSG_C224="作成报表,'@1'不能为空!";
var MSG_C225="操作提示:报表作成成功！";
var MSG_C226="操作提示:当前统计范围(对象年度：'@1')内,没有定时报表，不能手动作成！";
var MSG_C227="操作提示:当前统计范围(对象年度：'@1',对象季度：'@2')内,没有定时报表，不能手动作成！";
//added by wangpq begin 2015-01-21 转归对象随访补录时，随访日期不能大于该转归日期
var MSG_C228 = "随访日期必须小于等于转归日期（@1）！";
var MSG_C229 = "随访补录的随访管理状态不能为：失访！";
var MSG_C230 = "首防评估时随访管理状态只能为：继续随访！";
//added by wangpq end
var MSG_T083="\n是否确认转患者？";
var MSG_T084="是否确认新建糖尿病患者管理卡？";
var MSG_T085="转患者成功！";
var MSG_S227="开始日期和结束日期必须在同一年度！";
var MSG_J228="存在尚未关联的报卡！";

var MSG_C231 = "空腹血糖类型及血糖值或餐后血糖类型及血糖值至少填写一组数据！";
var MSG_C232 = "该报卡存在对应的高危筛查信息，其信息将同步删除，是否确认删除？";

var MSG_J232="检查项目@1超过上限（原始金额上限：‘@2’，减免次数上限：‘@3’次）";
var MSG_J233="检查项目@1超过上限（减免次数上限：‘@2’次）";
var MSG_J240="固定电话，联系人电话，移动电话 三者至少录入一个!";

//add by LuYiMin
var MSG_C234="录入随访时，如果本次随访管理状态为‘失访’或‘转组’,则随访日期不能小于末次随访(‘@1’)";
var MSG_C235="补录随访时，如果本次随访管理状态为‘在管’或‘暂时性失访’,则随访日期不能大于末次随访(‘@1’)";
var MSG_C236="新建管理卡时，市疾控结果调用异常，不能建卡!";

var MSG_T086="重新录入会导致复检血糖数据清空，是否确认清空？";
var MSG_J234="发票号码相同的情况下，发票日期、现金支付、账户支付、费用合计这四项必须保证一致!";
var MSG_J235="该发票号码已在其他申请单中出现，一张发票只能在一次申请中全部提交，不允许在不同的申请批次中出现发票号码相同的情况!";
var MSG_C237="“@1”不能保存数字，请重新输入！";
var MSG_C238="“@1”和“@2”不一致，请进行修改！";
var MSG_T087="转组成功，已存在高危报卡，无需新建卡！";
var MSG_Z239="选择【已死亡】的时候，卡氏评分只能选择“死亡”!";
var MSG_S240="不能选择一级职业，请重新选择！";
var MSG_C239="本地有关联的未完成的查重剔重任务，不允许删除！请回复查重剔重任务后重新操作。";
var MSG_C240="操作失败！";
var MSG_J236="当前年度定时报表还未生成！";
var MSG_J237="居住地必须为上海地址！";
var MSG_J238 = "本次确诊日期必须大于等于传报卡诊断时间（@1）！";
var DCTS = "2000";
var MSG_AQJG01 = "保存成功！";
var MSG_AQJG02 = "保存失败！";
var MSG_G122 ="已存在对应年度数据，是否覆盖？";
var MSG_C241 ="开始生成报表";
var MSG_C242="存在作成中的报表，请稍后再试";
var MSG_C243="是否重新作成报表？";
var MSG_S241="死亡证编号不符合规则！";
var MSG_C244="已有耐药患者登记号，不能手动清空登记号";
var MSG_C245="请确保死亡证编号、死者姓名及身份证号无误，这些信息将作为一网通办核验数据项！";
var MSG_C246="重建死亡报卡的死亡证编号与报废死亡报卡的死亡证编号一致，请确认调整！";
var MSG_C247="未查询到符合条件的数据";
var MSG_S242 = "@1：长度超长，限定40字节，画面输入@2字节，请修改！";

function getMessage(msg) {
	getMessage(msg, '');
}

function getMessage(msg, param1) {
	getMessage(msg, param1, '');
}

function getMessage(msg, param1, param2) {
	getMessage(msg, param1, param2, '');
}

function getMessage(msg, param1, param2, param3) {
	var returnMsg = msg;
	if (msg == null || msg == '') {return;}
	if (param1 != null && param1 != '') {
		returnMsg = returnMsg.replace('@1', param1);
	}
	if (param2 != null && param2 != '') {
		returnMsg = returnMsg.replace('@2', param2);
	}
	if (param3 != null && param3 != '') {
		returnMsg = returnMsg.replace('@3', param3);
	}
	return returnMsg;
}