var MSG_C001 = "必须项目未输入，请输入@1！";
var MSG_C002 = "本次操作已成功！";
var MSG_C003 = "是否确认@1选择的对象？";
var MSG_C004 = "请选择您需要处理的对象数据！";
var MSG_C005 = "导出对象数据过大（多余10000条），请重新输入检索条件查询后重新导出！";
var MSG_C006 = "数据录入尚未完成,无法进行数据比对！";
var MSG_C007 = "已经完成数据对比，不能再次录入！";
var MSG_C008 = "已进行数据录入，无法修改质控规则！";
var MSG_C009 = "@1和@2不能同时输入！";
var MSG_C010 = "查询模版保存时，至少选择一个项目！";
var MSG_C011 = "@1必须大于@2，请重新输入！";
var MSG_C012 = "@1必须大于等于@2，请重新输入！";
var MSG_C013 = "您输入的@1有误，请重新输入！";
var MSG_C014 = "该数据尚未进行数据比对，无法进行@1！";
var MSG_C015 = "您输入的@1超过了一般正常范围(@2)请确认！";
var MSG_C016 = "是否确认进行@1处理？";
var MSG_C017 = "没有可以导出的数据，请确认！";
var MSG_C018 = "当前选择对象无法完成@1操作！";
var MSG_C019 = "该数据已完成数据抽取，不需要再进行数据抽取处理！";
var MSG_C020 = "请选中一条数据";
var MSG_C021 = "已剔除报卡不能进行再次保留";
var MSG_C022 = "已保留报卡不能进行再次保留";
var MSG_C023 = "本次操作保存失败！";
var MSG_C024 = "请选择@1 及其 @2！";
var MSG_C025 = "@1不能超过最大长度@2！";
var MSG_C026 = "@1或@2不能为0";
var MSG_C027 = "@1不能超过100";
var MSG_C028 = "报告日期条件最多只能设定三组！";
var MSG_C029 = "请填写审核意见！";
var MSG_C030 = "最多只能选三项！";
var MSG_C031 = "已经完成抽取，不能删除！";
var MSG_C032 = "审核成功！";
var MSG_C033 = "抽取成功！";
var MSG_C034 = "确定要删除选中的记录吗？";
var MSG_C035 = "完成数据对比！";
var MSG_C036 = "该项质控数据比对未完成，不能查看统计分析！";
var MSG_C037 = "该项质控数据比对未完成，不能评价！";
var MSG_C038 = "评价成功！";
var MSG_C039 = "确定要进行随机抽取吗？";
var MSG_C040 = "完成抽取后将不能再次抽取，确定完成？";
var MSG_C041 = "没有进行数据比对，请进行数据比对后进行修改！";
var MSG_C042 = "请先完成数据抽取，再进行抽取字段！";
var MSG_C043 = "已经完成数据比对，不能再进行抽取！";
var MSG_C044 = "请先完成数据抽取，再进行录入！";
var MSG_C045 = "时间类型只能显示三组！";
var MSG_C046 = "你确定要撤销@1操作";
var MSG_C047 = "数据比对已完成，无法再进行比对！";
var MSG_C054 = "确定设为主卡？";
var MSG_C055 = "确定设为本社区现管？";
var MSG_C056 ="质控规则保存成功！可抽取的数据为@1条，因不存在足够的数据，数据抽取未完成，请修改质控规则后重新进行数据抽取！";
var MSG_C057 = "可抽取的数据为@1条,因不存在足够的数据，数据抽取未完成，请修改质控规则后重新进行数据抽取！";
var MSG_C058 ="质控规则保存成功！可抽取的数据为@1条至少需要@2%才能抽取出数据，因不存在足够的数据，数据抽取未完成，请修改质控规则后重新进行数据抽取！";
var MSG_C059 = "可抽取的数据为@1条,至少需要@2%才能抽取出数据,因不存在足够的数据，数据抽取未完成，请修改质控规则后重新进行数据抽取！";
var MSG_C060 = "该质控的数据已经下发区县，无法进行删除！";
var MSG_C061 = "没有进行数据录入，无法进行数据比对！";
var MSG_C062 = "已评价数据,无法再进行数据比对！";
var MSG_C063 = "该质控未进行数据比对，无法进行评价！";
var MSG_C064 = "该质控未进行评价，无法进行下发！";
var MSG_C065 = "请输入@1进行查询！";
var MSG_C066 = "@1和@2必须在同一年度！";
var MSG_C067 = "没有可以打印的数据，请确认！";
var MSG_C068 = "没有符合条件的数据！";
var MSG_C069 = "医疗机构属于【@1】且病人属于为“本市其他区县”时，居住地_县不能为【@2】！";

var MSG_C048 = "@1与@2必须在同一年份！";
var MSG_C049 = "是否确认进行本次保存操作？";
var MSG_C050 = "是否确认进行本次删除操作？";

var MSG_C051 = "@1年@2年报暂未生成，请重新选择！";
var MSG_C052 = "@1年@2月@3月报暂未生成，请重新选择！";
var MSG_C053 = "是否确认订正@1年@2月@3月报数据！";
var MSG_C054 ="【抽样绝对数≤总体错误上限】是否要继续操作?";

var MSG_C055 = "@1必须小于@2，请重新输入！";
var MSG_C056 = "@1必须小于等于@2，请重新输入！";

var MSG_C057="是否重新生成查重列表？";

var MSG_C070 = "列数超过256，请重新构造查询条件！";
var MSG_C071 = "请查询对象数据后进行下载！";


var MSG_G001 = "本次操作已成功！是否继续录入？";
var MSG_G002 = "该数据尚未进行数据抽取，无法展示质控对象数据列表！";
var MSG_G003 = "该年份的数据已经下发区县，无法添加！";
var MSG_G004= "您选择了部分数据，是否对该部分数据进行导出?";
var MSG_G005 = "保留该报卡则剩余重复卡均被剔除<br>是否确定保留？";
var MSG_G006 = "该条记录已存在，请勿重复录入！"

var MSG_J001 = "请注意，该病案尚未设定业务管理编号！";
var MSG_J002 ="请先选择要导入的文件!";//@2013-10-16 @pfl
var MSG_J003 ="选择的文件类型有误，请选择文件后缀为.csv的文件类型!"; //@2013-10-16 @pfl
var MSG_J004 = "解锁后将允许区县修改当前病案的所有内容，是否继续？";
var MSG_J005 = "锁定后将禁止区县修改当前病案（除费用减免）的所有内容，是否继续？";

var MSG_T001 = "该年份的随访规则已经存在，无法添加！\n请在已有数据基础上进行修改！";
var MSG_T002 = "高危人群报卡只能进行二次录入质控！";
var MSG_T003 = "该质控有已抽取数据，无法删除！";
var MSG_T004 = "请选择一条模版进行查看！";

var MSG_Z001 = "请选择一条模版进行查看！";
var MSG_Z002 = "【报告区县】与【统计方式】均为必填项！";

var MSG_T005="抽样百分比与抽样绝对数必须而且只能输入一项!";
var MSG_T006="本次操作失败!";
var MSG_T007="是否要进行订正操作?";
var MSG_T008="是否要进行数据对比操作?";
var MSG_T009="保存成功,是否要关闭窗口?";
var MSG_T010="该数据当前不能仲裁！";
var MSG_T011="请选择仲裁结果！";
var MSG_T012="仲裁成功！";
var MSG_T013="请修改抽样百分数，两者选一该项不可操作!";
var MSG_T014="请修改抽样绝对数，两者选一该项不可操作!";
var MSG_T015="患者随访卡没有转组信息，请重新选择！";
var MSG_T016="删除成功!";
var MSG_T017="确定要删除该条质控信息吗？";
var MSG_T018="该条质控中有已抽数据，暂时不可以删除!";
var MSG_T019="提交成功!";
var MSG_T020="是否下发任务?";
var MSG_T021="请选择一条模板！";
var MSG_T022="只能选择一条数据进行修改！";
var MSG_T023="请至少选中一条模板！";
var MSG_T024="确定要删除这些模板吗?";
var MSG_T025="模板已删除！";
var MSG_T026="保存成功！";
var MSG_T027="保存出错！";
var MSG_T028="高危报卡只有二次录入质控！";
var MSG_T029="模板名称已经存在！";
var MSG_T030="是否保存?";
var MSG_T031="你确定要撤销下发状态么";
var MSG_T032="该年份已有生效规则，无法添加！";
var MSG_T033="是否进行仲裁操作?";
var MSG_T034="未选定的报告卡会被设定成重复并不允许区县更新,是否确认进行保留处理?";
var MSG_T035="该质控已经有评价结果,修改数据可能会导致评价结果变化,是否继续?";
var MSG_N001="没有生成图表的数据！";

var MSG_S001="该地区该年已有相同类型的人口基础数据！";
var MSG_S002="死亡信息有修改，将会下发市疾控修改ICD通知，是否确认保存？";
var MSG_S003="当前年度的人口基础数据不存在，无法计算死亡率，请重新选择！";
var MSG_S004="审核为不通过时审核不通过原因必填";
var MSG_S005="审核不通过原因最多只能输入256个字符";
var MSG_S006 = "报告开始月份和报告结束月份之差不能超过12个月！";
var MSG_S009="人口类型选择全部时，地区不可以选择街道";
var MSG_S0010="人口类型选择非沪籍时，地区不可以选择街道";

var MSG_F001="@1录入数据不合格，请确认数据合格";
var MSG_F002="请选择检测菌种！";
var MSG_F003="请选择检测类型！";
var MSG_F004="该监测点缺少初始化数据,请通知维护人员!";

var MSG_M001="已维护专业人员档案";
var MSG_M002="已维护冷链设备档案"
var MSG_M003="出生日期不能大于当前日期"
var MSG_M004="培训合格日期不能大于当前日期"
var MSG_M005="培训有效期不能小于培训合格日期"
var MSG_M006 ="选择的文件有误，请选择正确的模板！"; 
var MSG_M007 ="导入成功,数据校验中！"; 
var MSG_M008="导入失败,请检查导入数据格式！";
var MSG_M009 ="正在执行数据校验,请稍后查看！"; 
var MSG_M010 ="正在执行查询,请稍候查看！"; 
var MSG_M011 ="@1和@2至少选择一个！";
var MSG_M012 ="合并成功！"; 
var MSG_M013 ="合并失败！"; 
var MSG_M014 ="已存在批签中检号相同的数据!"; 

var MSG_S007 ="人口类型选择全部时，区县不可以选择街道!"; 
var MSG_S008 ="人口类型选择非沪籍时，地区不可以选择街道!";

var DCTS=2000;

function getMessage(msg) {
	getMessage(msg, '');
}

function getMessage(msg, param1) {
	getMessage(msg, param1, '');
}

function getMessage(msg, param1, param2) {
	getMessage(msg, param1, param2, '');
}

function getMessage(msg, param1, param2, param3) {
	var returnMsg = msg;
	if (msg == null || msg == '') {return;}
	if (param1 != null && param1 != '') {
		returnMsg = returnMsg.replace('@1', param1);
	}
	if (param2 != null && param2 != '') {
		returnMsg = returnMsg.replace('@2', param2);
	}
	if (param3 != null && param3 != '') {
		returnMsg = returnMsg.replace('@3', param3);
	}
	return returnMsg;
}